{
  "version": "https://jsonfeed.org/version/1",
  "title": "dkotama",
  "home_page_url": "https://lumeland.github.io/base-blog/",
  "feed_url": "https://lumeland.github.io/base-blog/feed.json",
  "description": "I writes, and sometimes I code.",
  "author": {
    "name": "I Nyoman Darma Kotama,",
    "url": "https://dkotama.com/about-me/"
  },
  "items": [
    {
      "id": "https://lumeland.github.io/base-blog/posts/5-prinsip-stoic-untuk-kehidupan-modern-abpbl/",
      "url": "https://lumeland.github.io/base-blog/posts/5-prinsip-stoic-untuk-kehidupan-modern-abpbl/",
      "title": "5 Prinsip Stoikisme untuk kehidupan Modern",
      "content_html": "<p><img src=\"https://lumeland.github.io/base-blog/%5Cimg%5Cspring-bird-Vintage-Image-GraphicsFairy-768x440.jpg\" alt=\"prinsip prinsip filosofi stoikisme dalam kehidupan modern illustrasi\"></p>\n<p>Filosofi stoikisme telah memberikan perspektif baru dalam memandang kehidupan. Melalui prinsip-prinsipnya, kita diajak untuk menyikapi kehidupan dengan lebih bijaksana dan tenang. Berikut adalah lima prinsip stoikisme yang dapat diterapkan dalam kehidupan modern.</p>\n<h2>1. Ikhlaskan segala hal yang tidak bisa kita kendalikan</h2>\n<p><a href=\"https://lumeland.github.io/base-blog/tags/stoikisme\">Stoikisme</a> cukup jelas menekankan tentang <em>'Sphere of Control'</em> atau batas kontrol kita akan hal-hal yang bisa kita kendalikan. Dalam buku Henry Manampiring yang cukup populer berjudul &quot;Filosofi Teras&quot; <sup class=\"footnote-ref\"><a href=\"#fn1\" id=\"fnref1\">[1]</a></sup>, konsep <em>sphere of control</em> ini di translasikan menjadi Dikotomi Kendali. Konsepnya cukup mudah, yaitu hal-hal dalam hidup kita dapat dibagi menjadi 2 bagian,</p>\n<ol>\n<li>Hal yang dapat kita kendalikan</li>\n<li>Hal yang tidak dapat kita kendalikan</li>\n</ol>\n<p><em>&quot;Wah, gimana ya kalau nanti dia kecewa sama aku&quot;</em></p>\n<p>Pemikiran seperti ini tidak jarang terlintas di benak kita bukan? Kita sebagai makhluk sosial, sangat wajar menginginkan pengakuan atau menginginkan sebuah kontrol akan apa yang akan orang lain lakukan terhadap kita. Namun, hal ini jika dilihat dari perspektif filosofi stoikisme adalah suatu hal yang sia-sia.</p>\n<p>Bagaimana pendapat orang terhadap kita, bagaimana penilaian mereka dan bagaimana perlakuan mereka terhadap kita merupakan diluar kendali kita. Akan tetapi, bagaimana <em>effort</em> kita untuk membuat orang lain nyaman, menjadi orang yang sesuai dengan perkataan, dan menjadi lawan bicara yang asik, merupakan batas-batas kontrol kita terhadap diri kita. Maksimalkan saja hal-hal yang dalam kendali kita dalam bersikap terhadap ayah, ibu, saudara dan teman. Biarkan penilaian mereka tentang kamu, ditangan mereka. Langit tidak perlu menjelaskan dirinya tinggi, Berlian tidak perlu menjelaskan dirinya indah.</p>\n<blockquote>\n<p>Be so good, so they can't ignore you\n― Cal Newport</p>\n</blockquote>\n<h2>2. Jangan membeli barang karena gengsi</h2>\n<p>Dalam konteks Dikotomi Kendali, membeli barang untuk menarik perhatian orang lain adalah suatu tindakan yang sia-sia dalam pandangan stoikisme. Kita harus mempertanyakan niat sebenarnya di balik pembelian kita: Apakah ini kebutuhan atau hanya keinginan egois? Belilah barang yang benar-benar bermanfaat dan diinginkan, bukan hanya untuk memuaskan gengsi.</p>\n<blockquote>\n<p>We buy things, we don't need,\nwith money we don't have,\nto impress people we don't like.\n― Dave Ramsey, Fight Club</p>\n</blockquote>\n<p>Cara terbaik untuk menentukan apakah anda membutuhkan barang itu adalah dengan menanyakan pada diri anda sendiri. Apakah anda yang membutuhkan ? atau hanya memenuhi ego keinginan anda ? ambil jeda untuk berpikir, dan berikan waktu diri anda untuk memilah-milah realita yang ada. Beli <em>lah</em> barang karena anda yakin itu akan berguna dan anda benar-benar inginkan.</p>\n<h2>3. Bersyukurlah dalam segala keadaan</h2>\n<p>Stoikisme mengajarkan kita untuk selalu bersyukur dalam segala situasi. Dengan bersyukur, kita belajar menerima keadaan apa adanya dan menemukan kebahagiaan dalam hal-hal sederhana. Kebahagiaan tidak harus datang dari hal-hal besar dan luar biasa; seringkali, kebahagiaan terbesar ditemukan dalam kesederhanaan dan rasa syukur.</p>\n<h2>4. Bahagialah tanpa bergantung pada suatu hal</h2>\n<p>Kebahagiaan sejati dalam stoikisme tidak bergantung pada faktor eksternal. Ini adalah keadaan batin yang dapat dicapai melalui penerimaan, kebijaksanaan, dan keseimbangan emosi. Kita harus belajar menemukan kebahagiaan dari dalam, tidak tergantung pada pujian, kekayaan, atau status.</p>\n<h2>5. Praktik &gt; Teori</h2>\n<p>Stoikisme bukan hanya sekumpulan teori, tetapi praktik hidup. Hal terpenting dalam stoikisme adalah penerapan prinsip-prinsipnya dalam kehidupan sehari-hari. Dengan praktik, kita menginternalisasi nilai-nilai stoikisme dan menjadikannya bagian dari esensi kita.</p>\n<blockquote>\n<p>&quot;Bukan karena kita tidak tahu yang benar, tetapi karena kita tidak menerapkannya.&quot;\n― Seneca, Surat-Surat Moral kepada Lucilius</p>\n</blockquote>\n<p>Dengan menerapkan prinsip-prinsip stoikisme, kita dapat menjalani hidup yang lebih tenang, terkendali, dan bermakna.</p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><p>Manampiring, Henry. 2019. Filosofi Teras. Jakarta: PT.Kompas Media Nusantara <a href=\"#fnref1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>",
      "date_published": "2023-11-15T00:00:00Z"
    },
    {
      "id": "https://lumeland.github.io/base-blog/posts/boy-and-striped-cat-213j8/",
      "url": "https://lumeland.github.io/base-blog/posts/boy-and-striped-cat-213j8/",
      "title": "The Boy and the Striped Cat",
      "content_html": "<p><img src=\"https://lumeland.github.io/base-blog/img/boy-and-striped-cat-213j8.jpg\" alt=\"boy-and-striped-cat-japanese-story-illustration\"></p>\n<p>Once upon a time in a quiet suburb, nestled between the somber whispers of ancient trees, there lived a boy named Takumi. Takumi was a boy of few words, his thoughts oftentimes lost in the vast expanses of his own imagination. He was like a drop of water, seemingly insignificant, but holding a universe of possibilities within.</p>\n<p>One day, while wandering through the maze of narrow streets, Takumi encountered a cat. It was a peculiar cat, with fur as black as a moonless night, and a single white stripe running down its spine. As the cat walked toward him, Takumi felt an inexplicable pull, as if it were a magnet drawing him in.</p>\n<p>The cat stopped and gazed up at him with eyes that seemed to hold the knowledge of a thousand worlds. Takumi, entranced by its gaze, reached out a trembling hand, but the cat pulled away, disappearing into the shadows.</p>\n<p>From that day on, Takumi found himself inexplicably drawn to the cat. He would search for it in the dark corners of the town, in the spaces between the trees, and behind the shuttered windows of silent homes. He felt a strange connection to the creature, a yearning to understand and befriend it.</p>\n<p>One evening, as the sun dipped below the horizon, Takumi found himself walking through a tangled forest. It was then that he spotted the striped cat, perched atop a moss-covered stone. It stared at him, its eyes reflecting the last slivers of sunlight.</p>\n<p>“Why do you run away from me?” Takumi asked, his voice barely a whisper.</p>\n<p>“I am not running away, boy,” the cat replied, its voice as smooth as velvet. “I am leading you somewhere.”</p>\n<p>“Where?” Takumi wondered, curiosity pulsing through his veins.</p>\n<p>“To a place where you can learn to love me, but first, you must learn to love yourself,” the cat answered cryptically.</p>\n<p>The cat leaped off the stone and began to walk deeper into the forest. Takumi hesitated for a moment, then followed. The trees grew denser, their branches entwining like lovers' hands, and the air grew colder. As they ventured further, a thin layer of mist enveloped the ground, swallowing their footsteps.</p>\n<p>Finally, they reached a clearing bathed in silvery moonlight. At its center stood an old, twisted tree, its bark as gnarled as the lines etched in the palm of a fortune teller. The cat leaped onto one of its branches and stared down at Takumi.</p>\n<p>&quot;Here, you shall learn the art of loving,&quot; the cat announced, its voice echoing through the night.</p>\n<p>A sudden gust of wind swirled around them, carrying with it the whispers of a thousand forgotten memories. Takumi felt a warmth surge through his body, as if he were being embraced by the very essence of life.</p>\n<p>From that night on, Takumi returned to the clearing each evening, guided by the striped cat. The cat taught him the language of the forest, the secrets of the wind, and the song of the stars. It showed him how to listen with his heart, to feel the pulse of the world, and to let love flow through him like a river.</p>\n<p>As the weeks turned to months, Takumi found himself changing. The quiet boy who once struggled to connect with others now found himself immersed in the beauty of the world around him. He discovered that love was not something to be captured or possessed, but a force that lived within him, waiting to be awakened.</p>\n<p>And in the quiet moments between the lessons, Takumi would sit beside the cat, their hearts beating in sync, their souls intertwined like the branches of the twisted tree.</p>\n<p>One night, as the first frost of winter kissed the earth, the cat spoke to Takumi, its voice tinged with a melancholy he had never heard before.</p>\n<p>&quot;Our time together is coming to an end, Takumi,&quot; the cat said, its gaze fixed upon the moon.</p>\n<p>&quot;Why?&quot; Takumi asked, his heart heavy with sadness.</p>\n<p>&quot;Because you have learned what you needed to learn,&quot; the cat replied, its tail flicking gently. &quot;It is time for you to carry this newfound love back into the world and share it with others.&quot;</p>\n<p>Takumi closed his eyes, the weight of the cat's words settling upon his shoulders like a blanket of snow. &quot;Will I ever see you again?&quot; he asked, his voice trembling.</p>\n<p>The cat looked at him, its eyes glistening with unshed tears. &quot;I will always be with you, Takumi, in the whispers of the wind and the dance of the stars. And whenever you feel lost, simply close your eyes and listen with your heart.&quot;</p>\n<p>The next morning, Takumi awoke to find the cat gone, its absence as tangible as the emptiness that filled his heart. He stood in the clearing, the frost crunching beneath his feet, and listened to the silence that now enveloped the forest.</p>\n<p>With a deep breath, Takumi stepped out of the clearing and began his journey back to the world he had left behind. He carried with him the lessons he had learned and the love that now coursed through his veins like the lifeblood of the earth itself.</p>\n<p>In the years that followed, Takumi grew into a man who touched the lives of everyone he met. He shared his love through acts of kindness, compassion, and understanding, weaving a tapestry of connections that spanned the world.</p>\n<p>And in the quiet moments, when the wind whispered through the trees and the stars danced in the night sky, Takumi would close his eyes and remember the striped cat who had taught him the art of loving. He would listen with his heart, and in that sacred space, he would find the cat waiting for him, their souls forever entwined.</p>\n<p>The End.</p>",
      "date_published": "2023-03-30T00:00:00Z"
    },
    {
      "id": "https://lumeland.github.io/base-blog/posts/dialog-senja-913asdk/",
      "url": "https://lumeland.github.io/base-blog/posts/dialog-senja-913asdk/",
      "title": "Dialog Senja",
      "content_html": "<p><img src=\"https://lumeland.github.io/base-blog/img/bird3.png\" alt=\"cerita pendek tentang dialog senja\"></p>\n<p>&quot;<em>dik</em>, kamu nangis lagi ?&quot;, kata kakak seraya mengusap pipiku</p>\n<p>&quot;<em>ngga</em>, kok&quot; jawabku</p>\n<p>&quot;trus, kenapa <em>bengek</em> begitu?&quot;, tanya kakak</p>\n<p>&quot;sebenarnya aku <em>ngga</em> sedih, kak. Tapi mataku tiba-tiba berair.\nSemua hal-hal yang sudah aku lakukan dengannya, perlahan membatu menjadi memori,\ndan sekarang aku <em>ngga</em> mau kehilangan memori itu menjadi prasasti usang yang melekat di hatiku&quot;, kataku sambil menyeka air mata</p>\n<p>Langit kemudian merona jingga, dengan matahari yang sembunyi dibalik pohon tua di depan halamanku.</p>\n<p>&quot;dik, bukannya kamu benci dia ya ?&quot;, imbuhnya\n&quot;iya kak, aku benci semua keputusan bodohnya,\naku benci semua cacian dan tamparannya sewaktu kecil,\naku marah dengan cara dia yang selalu seenaknya sendiri&quot;, jawabku</p>\n<p>&quot;<em>lha</em> , trus kenapa kamu menangis? seharusnya kamu senang, dia pergi akhirnya tidak ada yang mengusikmu <em>kan</em> ?&quot;</p>\n<p>&quot;setiap kali aku memastikan kebencianku, aku tersadar bahwa,\nseribu kali pun aku hidup kembali, aku <em>ngga</em> akan pernah bisa mengembalikan\nsemua yang sudah dia lakukan padaku kak. Semua luka dan bekas ingatan buruk yang dia berikan padaku\nsemata-mata untuk memperlihatkanku bahwa ia adalah contoh buruk yang tidak harus aku contoh,\ndan dia bukan manusia super, yang tahu harus berbuat apa dengan pilihan hidup yang amat sangat terbatas.&quot;, jawabku sambil mengambil nafas</p>\n<p>&quot;memang, saat ia hilang, semua baru terasa masuk akal. Dan bagian diriku yang menyesali ini baru keluar untuk ikut menangis&quot;, imbuhku</p>\n<p>&quot;<em>dik</em>, menangis itu wajar. Apalagi kita kehilangan sesosok tumpuan hidup. Tapi menyesali apa yang sudah terjadi itu <em>ngga</em> masuk akal.&quot;, kata kakak</p>\n<p>&quot;kenapa kak? bukankah penyesalan itu mendatangkan ilham bagi kita untuk berbuat menjadi orang yang lebih baik lagi ?&quot;, kataku sambil melihat wajak kakakku yang merona jingga</p>\n<p>&quot;iya betul, penyesalan melahirkan refleksi pemikiran kita untuk maju kedepan. Tapi menyesal akan apa yang sudah terjadi, apalagi sampai berlarut didalamnya\nhanya akan membuatmu tenggelam dalam jurang keputus-asaan&quot;, kata kakak</p>\n<p>&quot;iya, kak. Aku sangat tahu itu&quot;, jawabku cepat\n&quot;aku sangat paham liku jurang itu,\naku tinggal disana menahun lamanya,\ndan sekarang ketika aku bersiap untuk kembali ke daratan, aku melihat dasar jurang itu lagi&quot;, imbuhku</p>\n<p>&quot;yasudah, nampaknya tidak ada jalan lain, selain membiarkan semua sisi dirimu menangis <em>dik</em>&quot;, kata kakak</p>\n<p>&quot;betul kak, aku pun tidak ingin kembali lagi ke jurang itu.\nSepertinya hanya waktu yang bisa mengikhlaskan memori ini menggunung di hatiku&quot;, kataku</p>\n<p>Langitpun redup, diiringi dengan burung-burung terbang kembali ke sarangnya.\nKakak beranjak masuk kedalam, namun aku masih terpaku pada rona redup sang surya.\nAku harap luka-luka ini cepat pulih.</p>",
      "date_published": "2022-08-25T00:00:00Z"
    },
    {
      "id": "https://lumeland.github.io/base-blog/posts/memento-mori-sebuah-seni-menghargai-waktu-qo2pq/",
      "url": "https://lumeland.github.io/base-blog/posts/memento-mori-sebuah-seni-menghargai-waktu-qo2pq/",
      "title": "Memento Mori ― Sebuah seni untuk menghargai waktu.",
      "content_html": "<p><img src=\"https://lumeland.github.io/base-blog/img/bird1.png\" alt=\"memento mori illustration\"></p>\n<p>Berbicara tentang kematian, kadang membuat kita yang masih muda risih. Kenapa <em>sih</em> kita harus berpikir sejauh itu? <em>toh</em> kita masih sehat saja, badan masih kuat, uang jajan untuk besok juga masih ada.</p>\n<p>Ajaran dari filosofi teras, yang memegang teguh tentang bagaimana kita harus mengubah perspektif terhadap kemalangan hidup (<em>suffering</em>) membuat sebuah konsep kematian dilihat sebagai sebuah hal yang harus dihargai, karena sejatinya dalam kehidupan setiap orang satu-satunya hal yang pasti adalah kematian.</p>\n<p>Memento Mori berasal dari bahasa latin yang berarti <em>&quot;Remember you must die&quot;</em> atau &quot;Ingatlah kelak kamu harus mati&quot;. Praktisi filosofi teras banyak menerapkan pemikiran ini sebagai cambuk untuk menjadi lebih baik setiap harinya, agar kelak nanti ketika senja menjemput tidak akan ada lagi penyesalan karena sudah menyia-nyiakan semua kesempatan hidup yang ada.</p>\n<blockquote>\n<p>Sudah seharusnya kita berpikir setiap harinya dengan prinsip bahwa kelak kita akan meninggalkan dunia ini.</p>\n</blockquote>\n<blockquote>\n<p>Dengan demikian kita tidak akan pernah berpikir untuk menunda-nunda. Seseorang yang berpikir bahwa setiap tindakan yang dia lakukan adalah tindakan terbaik menuju akhir hidupnya, niscaya tidak akan pernah kehabisan waktu untuk melakukan apapun</p>\n</blockquote>\n<blockquote>\n<p>― Seneca, Moral Letters to Lucilius</p>\n</blockquote>",
      "date_published": "2022-07-11T00:00:00Z"
    },
    {
      "id": "https://lumeland.github.io/base-blog/posts/amor-fati-cintailah-takdirmu-2foun/",
      "url": "https://lumeland.github.io/base-blog/posts/amor-fati-cintailah-takdirmu-2foun/",
      "title": "Amor Fati ― Cintailah takdirmu",
      "content_html": "<p><img src=\"https://lumeland.github.io/base-blog/img/bird2.png\" alt=\"amor fati illustration\"></p>\n<p><em>Amor Fati</em> memiliki arti &quot;Cintailah takdirmu&quot;. Sepaham dengan ajaran <a href=\"https://lumeland.github.io/base-blog/tags/stoikisme\">stoikisme</a>, seorang filsuf eksistensialis ternama asal Jerman yang bernama Frederic Nietzche mengulas tentang pentingnya kita mengambil perspektif baru dalam menghadapi hal manusiawi bernama ― takdir.</p>\n<p>Sejatinya takdir yang terjadi pada masa lalu atau masa sekarang, adalah sesuatu yang tidak dapat dihindari. Kemalangan, kesenangan, kesedihan dan segala emosi yang terjadi pada saat kita melalui takdir itu menurut Nietzche hendaknya di arahkan dalam perspektif baru untuk mengambil hikmahnya sehingga kita bisa berjalan lebih jauh dalam perjalanan abadi kita untuk mengenal diri sendiri ini.</p>\n<blockquote>\n<p>Amor Fati adalah caraku untuk menghadapi kehidupan ini,\ndimana kita tidak mengharapkan sesuatu akan terjadi berbeda,\ntidak di masa lalu, tidak di masa depan, ataupun selamanya,</p>\n</blockquote>\n<blockquote>\n<p>dan tidak semata-mata berserah diri akan apa yang terjadi, namun sebaliknya, mencintai takdirku.</p>\n</blockquote>\n<blockquote>\n<p>― Frederic Nietzche</p>\n</blockquote>",
      "date_published": "2022-07-11T00:00:00Z"
    }
  ]
}